With k8s version upgrades as well:

pilot-hubs

<details>
<pre>
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary will be updated in-place
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster"
      ~ min_master_version          = "1.18.15-gke.1500" -> "1.19.9-gke.1400"
        name                        = "low-touch-hubs-cluster"
        # (26 unchanged attributes hidden)














        # (16 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["core-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/core-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-core-pool-097eafe9-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "core-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 1 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
      ~ version             = "1.17.12-gke.2502" -> "1.19.9-gke.1400"
        # (4 unchanged attributes hidden)

      ~ autoscaling {
          ~ max_node_count = 10 -> 5
            # (1 unchanged attribute hidden)
        }


      ~ node_config {
          ~ disk_size_gb      = 100 -> 50 # forces replacement
          ~ labels            = { # forces replacement
              + "hub.jupyter.org/node-purpose" = "core"
              + "k8s.dask.org/node-purpose"    = "core"
                # (4 unchanged elements hidden)
            }
          ~ machine_type      = "n1-highmem-4" -> "e2-highcpu-4" # forces replacement
            tags              = [
                "gke-low-touch-hubs-cluster",
                "gke-low-touch-hubs-cluster-core-pool",
            ]
          ~ taint             = [] -> (known after apply)
            # (8 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["dask-worker-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/dask-worker-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-c-dask-worker-pool-366d69db-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "dask-worker-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 0 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
      ~ version             = "1.17.12-gke.2502" -> "1.19.9-gke.1400"
        # (4 unchanged attributes hidden)



      ~ node_config {
          ~ labels            = { # forces replacement
              + "k8s.dask.org/node-purpose" = "worker"
                # (3 unchanged elements hidden)
            }
            tags              = [
                "gke-low-touch-hubs-cluster",
                "gke-low-touch-hubs-cluster-dask-worker-pool",
            ]
            # (11 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (3 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["user-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/two-eye-two-see/locations/us-central1-b/clusters/low-touch-hubs-cluster/nodePools/user-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-low-touch-hubs-cluster-user-pool-f2555475-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "user-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 1 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
      ~ version             = "1.17.12-gke.2502" -> "1.19.9-gke.1400"
        # (4 unchanged attributes hidden)



      ~ node_config {
          ~ labels            = { # forces replacement
              + "hub.jupyter.org/node-purpose" = "user"
              + "k8s.dask.org/node-purpose"    = "scheduler"
                # (3 unchanged elements hidden)
            }
          ~ machine_type      = "n1-highmem-2" -> "n1-standard-4" # forces replacement
            tags              = [
                "gke-low-touch-hubs-cluster",
                "gke-low-touch-hubs-cluster-user-pool",
            ]
            # (10 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
    # (1 unchanged attribute hidden)

------------------------------------------------------------------------
</pre>
</details>

cloudbank

<details>
<pre>
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary will be updated in-place
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster"
      ~ min_master_version          = "1.18.15-gke.1100" -> "1.19.9-gke.1400"
        name                        = "cloudbank-2i2c-cluster"
      ~ remove_default_node_pool    = false -> true
        # (25 unchanged attributes hidden)













        # (16 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["core-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster/nodePools/core-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cb-1003-1696/zones/us-central1-b/instanceGroupManagers/gke-cloudbank-2i2c-cluster-core-pool-2008707b-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "core-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 1 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
      ~ version             = "1.17.12-gke.2502" -> "1.19.9-gke.1400"
        # (4 unchanged attributes hidden)

      ~ autoscaling {
          ~ max_node_count = 10 -> 5
            # (1 unchanged attribute hidden)
        }


      ~ node_config {
          ~ disk_size_gb      = 100 -> 50 # forces replacement
          ~ image_type        = "UBUNTU" -> "COS"
          ~ labels            = { # forces replacement
              + "hub.jupyter.org/node-purpose" = "core"
              + "k8s.dask.org/node-purpose"    = "core"
                # (4 unchanged elements hidden)
            }
          ~ machine_type      = "n1-highmem-2" -> "e2-highcpu-4" # forces replacement
            tags              = [
                "gke-cloudbank-2i2c-cluster",
                "gke-cloudbank-2i2c-cluster-core-pool",
            ]
          ~ taint             = [] -> (known after apply)
            # (7 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["dask-worker-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = "cloudbank-2i2c-cluster"
      + id                  = (known after apply)
      + initial_node_count  = 0
      + instance_group_urls = (known after apply)
      + location            = "us-central1-b"
      + max_pods_per_node   = (known after apply)
      + name                = "dask-worker-pool"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + operation           = (known after apply)
      + project             = "cb-1003-1696"
      + version             = "1.19.9-gke.1400"

      + autoscaling {
          + max_node_count = 10
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-ssd"
          + guest_accelerator = []
          + image_type        = "COS"
          + labels            = {
              + "cluster_name"              = "cloudbank-2i2c-cluster"
              + "hub.jupyter.org/pool-name" = "dask-worker-pool"
              + "k8s.dask.org/node-purpose" = "worker"
              + "node_pool"                 = "dask-worker-pool"
            }
          + local_ssd_count   = 0
          + machine_type      = "e2-highmem-2"
          + metadata          = {
              + "cluster_name"             = "cloudbank-2i2c-cluster"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "dask-worker-pool"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com"
          + tags              = [
              + "gke-cloudbank-2i2c-cluster",
              + "gke-cloudbank-2i2c-cluster-dask-worker-pool",
            ]
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "k8s.dask.org_dedicated"
                  + value  = "worker"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.gke.google_container_node_pool.pools["dask-worker-pool-2020-12-11"] will be destroyed
  - resource "google_container_node_pool" "pools" {
      - cluster             = "cloudbank-2i2c-cluster" -> null
      - id                  = "projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster/nodePools/dask-worker-pool-2020-12-11" -> null
      - initial_node_count  = 0 -> null
      - instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cb-1003-1696/zones/us-central1-b/instanceGroupManagers/gke-cloudbank-2i2c-c-dask-worker-pool-729d24bb-grp",
        ] -> null
      - location            = "us-central1-b" -> null
      - max_pods_per_node   = 110 -> null
      - name                = "dask-worker-pool-2020-12-11" -> null
      - node_count          = 0 -> null
      - node_locations      = [
          - "us-central1-b",
        ] -> null
      - project             = "cb-1003-1696" -> null
      - version             = "1.17.12-gke.2502" -> null

      - autoscaling {
          - max_node_count = 10 -> null
          - min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = false -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-ssd" -> null
          - guest_accelerator = [] -> null
          - image_type        = "UBUNTU" -> null
          - labels            = {
              - "cluster_name"              = "cloudbank-2i2c-cluster"
              - "hub.jupyter.org/pool-name" = "dask-worker-pool"
              - "node_pool"                 = "dask-worker-pool-2020-12-11"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "e2-standard-4" -> null
          - metadata          = {
              - "cluster_name"             = "cloudbank-2i2c-cluster"
              - "disable-legacy-endpoints" = "true"
              - "node_pool"                = "dask-worker-pool-2020-12-11"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = true -> null
          - service_account   = "tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-cloudbank-2i2c-cluster",
              - "gke-cloudbank-2i2c-cluster-dask-worker-pool-2020-12-11",
            ] -> null
          - taint             = [
              - {
                  - effect = "NO_SCHEDULE"
                  - key    = "k8s.dask.org_dedicated"
                  - value  = "worker"
                },
            ] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - node_metadata = "GKE_METADATA_SERVER" -> null
            }
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
        }
    }

  # module.gke.google_container_node_pool.pools["user-pool"] will be created
  + resource "google_container_node_pool" "pools" {
      + cluster             = "cloudbank-2i2c-cluster"
      + id                  = (known after apply)
      + initial_node_count  = 0
      + instance_group_urls = (known after apply)
      + location            = "us-central1-b"
      + max_pods_per_node   = (known after apply)
      + name                = "user-pool"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + operation           = (known after apply)
      + project             = "cb-1003-1696"
      + version             = "1.19.9-gke.1400"

      + autoscaling {
          + max_node_count = 10
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = "pd-ssd"
          + guest_accelerator = []
          + image_type        = "COS"
          + labels            = {
              + "cluster_name"                 = "cloudbank-2i2c-cluster"
              + "hub.jupyter.org/node-purpose" = "user"
              + "hub.jupyter.org/pool-name"    = "user-pool"
              + "k8s.dask.org/node-purpose"    = "scheduler"
              + "node_pool"                    = "user-pool"
            }
          + local_ssd_count   = 0
          + machine_type      = "n1-standard-4"
          + metadata          = {
              + "cluster_name"             = "cloudbank-2i2c-cluster"
              + "disable-legacy-endpoints" = "true"
              + "node_pool"                = "user-pool"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = "tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com"
          + tags              = [
              + "gke-cloudbank-2i2c-cluster",
              + "gke-cloudbank-2i2c-cluster-user-pool",
            ]
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "hub.jupyter.org_dedicated"
                  + value  = "user"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = false
            }

          + workload_metadata_config {
              + node_metadata = "GKE_METADATA_SERVER"
            }
        }

      + timeouts {
          + create = "45m"
          + delete = "45m"
          + update = "45m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # module.gke.google_container_node_pool.pools["user-pool-2020-09-29"] will be destroyed
  - resource "google_container_node_pool" "pools" {
      - cluster             = "cloudbank-2i2c-cluster" -> null
      - id                  = "projects/cb-1003-1696/locations/us-central1-b/clusters/cloudbank-2i2c-cluster/nodePools/user-pool-2020-09-29" -> null
      - initial_node_count  = 0 -> null
      - instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cb-1003-1696/zones/us-central1-b/instanceGroupManagers/gke-cloudbank-2i2c-c-user-pool-2020-0-22cd12eb-grp",
        ] -> null
      - location            = "us-central1-b" -> null
      - max_pods_per_node   = 110 -> null
      - name                = "user-pool-2020-09-29" -> null
      - node_count          = 1 -> null
      - node_locations      = [
          - "us-central1-b",
        ] -> null
      - project             = "cb-1003-1696" -> null
      - version             = "1.17.12-gke.2502" -> null

      - autoscaling {
          - max_node_count = 10 -> null
          - min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = false -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-ssd" -> null
          - guest_accelerator = [] -> null
          - image_type        = "UBUNTU" -> null
          - labels            = {
              - "cluster_name"              = "cloudbank-2i2c-cluster"
              - "hub.jupyter.org/pool-name" = "user-pool"
              - "node_pool"                 = "user-pool-2020-09-29"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "n1-highmem-4" -> null
          - metadata          = {
              - "cluster_name"             = "cloudbank-2i2c-cluster"
              - "disable-legacy-endpoints" = "true"
              - "node_pool"                = "user-pool-2020-09-29"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = false -> null
          - service_account   = "tf-gke-cloudbank-2i2c--g6vk@cb-1003-1696.iam.gserviceaccount.com" -> null
          - tags              = [
              - "gke-cloudbank-2i2c-cluster",
              - "gke-cloudbank-2i2c-cluster-user-pool-2020-09-29",
            ] -> null
          - taint             = [
              - {
                  - effect = "NO_SCHEDULE"
                  - key    = "hub.jupyter.org_dedicated"
                  - value  = "user"
                },
            ] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - node_metadata = "GKE_METADATA_SERVER" -> null
            }
        }

      - timeouts {
          - create = "45m" -> null
          - delete = "45m" -> null
          - update = "45m" -> null
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
        }
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
    # (1 unchanged attribute hidden)

</pre>
</details>